In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aaa','bbb',np.nan,'ccc'])
string_data

0    aaa
1    bbb
2    NaN
3    ccc
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data

0    None
1     bbb
2     NaN
3     ccc
dtype: object

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1,NA,3,NA,7])

In [9]:
data

0    1.0
1    NaN
2    3.0
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.0
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6,4]])

In [13]:
cleaned = data.dropna()

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  4.0

In [16]:
cleaned = data.dropna(how = 'all')

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.0  4.0

In [18]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [19]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.283806 -0.282054 -0.559287
1  0.073127  1.298321  1.886328
2 -0.492248  0.095680 -0.807730
3 -0.588747 -0.752813 -0.792017
4 -0.389346  0.969873  1.468151
5  0.222172 -0.150668  0.711679
6 -0.076194  0.979310  1.473094

In [20]:
df.iloc[0:4,1] = NA
df.iloc[0:2,2] = NA
df

          0         1         2
0 -0.283806       NaN       NaN
1  0.073127       NaN       NaN
2 -0.492248       NaN -0.807730
3 -0.588747       NaN -0.792017
4 -0.389346  0.969873  1.468151
5  0.222172 -0.150668  0.711679
6 -0.076194  0.979310  1.473094

In [24]:
df.dropna(thresh=2)

          0         1         2
2 -0.492248       NaN -0.807730
3 -0.588747       NaN -0.792017
4 -0.389346  0.969873  1.468151
5  0.222172 -0.150668  0.711679
6 -0.076194  0.979310  1.473094

In [25]:
df.fillna(0)

          0         1         2
0 -0.283806  0.000000  0.000000
1  0.073127  0.000000  0.000000
2 -0.492248  0.000000 -0.807730
3 -0.588747  0.000000 -0.792017
4 -0.389346  0.969873  1.468151
5  0.222172 -0.150668  0.711679
6 -0.076194  0.979310  1.473094

In [27]:
df.fillna({1:0.1,2:0.2})

          0         1         2
0 -0.283806  0.100000  0.200000
1  0.073127  0.100000  0.200000
2 -0.492248  0.100000 -0.807730
3 -0.588747  0.100000 -0.792017
4 -0.389346  0.969873  1.468151
5  0.222172 -0.150668  0.711679
6 -0.076194  0.979310  1.473094

In [28]:
df.iloc[0:4,1] = NA
df.iloc[0:2,2] = NA
df

          0         1         2
0 -0.283806       NaN       NaN
1  0.073127       NaN       NaN
2 -0.492248       NaN -0.807730
3 -0.588747       NaN -0.792017
4 -0.389346  0.969873  1.468151
5  0.222172 -0.150668  0.711679
6 -0.076194  0.979310  1.473094

In [34]:
df.fillna(999)

          0           1           2
0 -0.283806  999.000000  999.000000
1  0.073127  999.000000  999.000000
2 -0.492248  999.000000   -0.807730
3 -0.588747  999.000000   -0.792017
4 -0.389346    0.969873    1.468151
5  0.222172   -0.150668    0.711679
6 -0.076194    0.979310    1.473094

In [36]:
data = pd.DataFrame({'k1':['a','b']*3+['b'],'k2':[1,1,2,3,3,4,4]})

In [37]:
data

  k1  k2
0  a   1
1  b   1
2  a   2
3  b   3
4  a   3
5  b   4
6  b   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

  k1  k2
0  a   1
1  b   1
2  a   2
3  b   3
4  a   3
5  b   4

In [40]:
data['v1'] = range(7)

In [41]:
data

  k1  k2  v1
0  a   1   0
1  b   1   1
2  a   2   2
3  b   3   3
4  a   3   4
5  b   4   5
6  b   4   6

In [44]:
data.drop_duplicates(['k1'],keep = 'last')

  k1  k2  v1
4  a   3   4
6  b   4   6

In [45]:
data = pd.DataFrame({'food':['a','b','c','d'],'num':[1,2,3,4]})

In [46]:
map2food = {'a':'apple','b':'bread','c':'cake','d':'dave'}

In [47]:
data['realfood'] = data['food'].map(map2food)

In [48]:
data

  food  num realfood
0    a    1    apple
1    b    2    bread
2    c    3     cake
3    d    4     dave

In [49]:
data = pd.Series([1,2,999,999,1000])

In [50]:
data.replace(999,NA)

0       1.0
1       2.0
2       NaN
3       NaN
4    1000.0
dtype: float64

In [53]:
data.replace([999,1000],[NA,999])

0      1.0
1      2.0
2      NaN
3      NaN
4    999.0
dtype: float64

In [55]:
data.replace({999:'aaa',1000:'bbb'})

0      1
1      2
2    aaa
3    aaa
4    bbb
dtype: object